Revit 2024 API
ParameterTypeId.StairsWinderpatternStairPathOffset Property
 "Inside Walk Line Offset": The offset from inside walk line to interior boundary
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairsWinderpatternStairPathOffset { get; }
Visual Basic
Public Shared ReadOnly Property StairsWinderpatternStairPathOffset As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairsWinderpatternStairPathOffset {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace